chengy2/goodix_hdsc_spi/hc32f46x_ddl_Rev1.1.1/example/spi/spi_fp_boot/source/misc.c
    return u8Byte;
}

/**
 *******************************************************************************
 ** \brief  SPI read bytes  (read ID) //todo
 ** \param  None
 ** \retval None
 ******************************************************************************/
en_result_t SpiFlash_ReadData(uint32_t u32Addr, uint8_t pData[], uint16_t len)
{
    en_result_t enRet = Ok;
    uint16_t u16Index = 0u;

    if (NULL == pData)
    {
        enRet = Error;
    }
    else
    {
//        SpiFlash_WriteEnable();
        /* Send data to flash */
        SPI_NSS_LOW();
        SpiFlash_WriteReadByte(0xF0);
//        SpiFlash_WriteReadByte((uint8_t)((u32Addr & 0xFF0000ul) >> 16u));
        SpiFlash_WriteReadByte((uint8_t)((u32Addr & 0xFF00u) >> 8u));
        SpiFlash_WriteReadByte((uint8_t)(u32Addr & 0xFFu));
        SPI_NSS_HIGH();
        Ddl_Delay1ms(100);
        SPI_NSS_LOW();
        SpiFlash_WriteReadByte(0xF1);
        while (len--)
        {
            pData[u16Index] = SpiFlash_WriteReadByte(SPI_DUMMY_BYTE_VALUE);
            u16Index++;
        }

        while (Reset == SPI_GetFlag(SPI_UNIT, SpiFlagSpiIdle))
        {
        }
        SPI_NSS_HIGH();
    }
    return enRet;
}

void SPI_RxCmplt(void)
{
    SPI_NSS_HIGH();
    DMA_ClearIrqFlag(SPI_DMA_RX_UNIT, SPI_DMA_RX_CH, TrnCpltIrq);
    DMA_ClearIrqFlag(SPI_DMA_RX_UNIT, SPI_DMA_RX_CH, BlkTrnCpltIrq);
    DMA_ClearIrqFlag(SPI_DMA_TX_UNIT, SPI_DMA_TX_CH, TrnCpltIrq);
    DMA_ClearIrqFlag(SPI_DMA_TX_UNIT, SPI_DMA_TX_CH, BlkTrnCpltIrq);
}

void SPI_TxCmplt(void)
{
    __asm("nop");
}

void MasterSpiDmaInit(void)
{
    stc_irq_regi_conf_t stcIrqRegiConf;
    stc_dma_config_t stcDmaCfg;

    /* configuration structure initialization */
    MEM_ZERO_STRUCT(stcDmaCfg);

    PWC_Fcg0PeriphClockCmd(PWC_FCG0_PERIPH_AOS | PWC_FCG0_PERIPH_DMA1, Enable);

    /* Configure TX DMA */
    stcDmaCfg.u16BlockSize = 1u;
//    stcDmaCfg.u16TransferCnt = u16BufferLen;
    stcDmaCfg.u32SrcAddr = (uint32_t)(&SpiDummyByte);
    stcDmaCfg.u32DesAddr = (uint32_t)(&SPI_UNIT->DR);
    stcDmaCfg.stcDmaChCfg.enSrcInc = AddressFix;
    stcDmaCfg.stcDmaChCfg.enDesInc = AddressFix;
    stcDmaCfg.stcDmaChCfg.enTrnWidth = Dma8Bit;
    stcDmaCfg.stcDmaChCfg.enIntEn = Disable;
    DMA_InitChannel(SPI_DMA_TX_UNIT, SPI_DMA_TX_CH, &stcDmaCfg);

    /* Configure RX DMA */
    stcDmaCfg.u16BlockSize = 1u;
//    stcDmaCfg.u16TransferCnt = u16BufferLen;
    stcDmaCfg.u32SrcAddr = (uint32_t)(&SPI_UNIT->DR);
//    stcDmaCfg.u32DesAddr = (uint32_t)(&u8RxBuffer[0]);
    stcDmaCfg.stcDmaChCfg.enSrcInc = AddressFix;
    stcDmaCfg.stcDmaChCfg.enDesInc = AddressIncrease;
    stcDmaCfg.stcDmaChCfg.enTrnWidth = Dma8Bit;
    stcDmaCfg.stcDmaChCfg.enIntEn = Enable;
    DMA_InitChannel(SPI_DMA_RX_UNIT, SPI_DMA_RX_CH, &stcDmaCfg);

    DMA_SetTriggerSrc(SPI_DMA_TX_UNIT, SPI_DMA_TX_CH, SPI_DMA_TX_TRIG_SOURCE);
    DMA_SetTriggerSrc(SPI_DMA_RX_UNIT, SPI_DMA_RX_CH, SPI_DMA_RX_TRIG_SOURCE);

    /* interrupt */
//    stcIrqRegiConf.enIntSrc = SPI_MASTER_DMA_TX_INT_SRC;
//    stcIrqRegiConf.enIRQn = SPI_MASTER_DMA_TX_IRQn;
//    stcIrqRegiConf.pfnCallback = &SPI_TxCmplt;
//    enIrqRegistration(stcIrqRegiConf);
//    DMA_EnableIrq(SPI_DMA_TX_UNIT, SPI_DMA_TX_CH, TrnCpltIrq);

    stcIrqRegiConf.enIntSrc = SPI_MASTER_DMA_RX_INT_SRC;
    stcIrqRegiConf.enIRQn = SPI_MASTER_DMA_RX_IRQn;
    stcIrqRegiConf.pfnCallback = &SPI_RxCmplt;
    enIrqRegistration(&stcIrqRegiConf);
    DMA_EnableIrq(SPI_DMA_RX_UNIT, SPI_DMA_RX_CH, TrnCpltIrq);

//    HAL_NVIC_SetPriority(SPI_MASTER_DMA_TX_IRQn, 0, 1);
//    HAL_NVIC_EnableIRQ(SPI_MASTER_DMA_TX_IRQn);

    HAL_NVIC_SetPriority(SPI_MASTER_DMA_RX_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(SPI_MASTER_DMA_RX_IRQn);

    DMA_Cmd(SPI_DMA_TX_UNIT, Enable);
    DMA_Cmd(SPI_DMA_RX_UNIT, Enable);
}

/**
 *******************************************************************************
 ** \brief  Receive SPI data with DMA
 ** \param  [in] SPIx                   SPI Unit
 **              SPI_UNIT               SPI Master unit
 **              SPI_SLAVE_UNIT         SPI Slave unit
 ** \param  [in] pu8Data
 ** \param  [in] len
 ** \retval None
 ******************************************************************************/
en_result_t HAL_SPI_Receive_DMA(const M4_SPI_TypeDef *SPIx, uint8_t pu8Data[], uint16_t len)
{
    en_result_t enRet = Ok;
    stc_dma_ch_cfg_t stcDmaChCfg;

    if ((NULL == SPIx) || (NULL == pu8Data))
    {
        enRet = ErrorInvalidParameter;
    }
    else if(SPI_UNIT == SPIx)
    {
        /* SPI master data receive */
        SPI_Cmd(SPI_UNIT, Disable);
//        DMA_SetSrcAddress(SPI_DMA_TX_UNIT, SPI_DMA_TX_CH, &SpiDummyByte);
//        DMA_SetDesAddress(SPI_DMA_TX_UNIT, SPI_DMA_TX_CH, (uint32_t)&SPIx->DR);
        DMA_SetTransferCnt(SPI_DMA_TX_UNIT, SPI_DMA_TX_CH, len);
        DMA_SetTransferCnt(SPI_DMA_RX_UNIT, SPI_DMA_RX_CH, len);

//        DMA_SetSrcAddress(SPI_DMA_RX_UNIT, SPI_DMA_RX_CH, (uint32_t)&SPIx->DR);
        DMA_SetDesAddress(SPI_DMA_RX_UNIT, SPI_DMA_RX_CH, (uint32_t)pu8Data);

        DMA_ChannelCmd(SPI_DMA_RX_UNIT, SPI_DMA_RX_CH, Enable);
        DMA_ChannelCmd(SPI_DMA_TX_UNIT, SPI_DMA_TX_CH, Enable);

        SPI_Cmd(SPI_UNIT, Enable);
    }
    else if(SPI_SLAVE_UNIT == SPIx)
    {
        MEM_ZERO_STRUCT(stcDmaChCfg);
        /* DMA src and des inc config */
        stcDmaChCfg.enSrcInc = AddressFix;
        stcDmaChCfg.enDesInc = AddressFix;
        stcDmaChCfg.enTrnWidth = Dma8Bit;
        stcDmaChCfg.enIntEn = Disable;
        DMA_ChannelCfg(SPI_SLAVE_DMA_TX_UNIT, SPI_SLAVE_DMA_TX_CH, &stcDmaChCfg);

         /* DMA src and des inc config */
        stcDmaChCfg.enSrcInc = AddressFix;
        stcDmaChCfg.enDesInc = AddressIncrease;
        stcDmaChCfg.enTrnWidth = Dma8Bit;
        stcDmaChCfg.enIntEn = Enable;
        DMA_ChannelCfg(SPI_SLAVE_DMA_RX_UNIT, SPI_SLAVE_DMA_RX_CH, &stcDmaChCfg);

        /* SPI slave data receive */
        SPI_Cmd(SPI_SLAVE_UNIT, Disable);
        DMA_SetSrcAddress(SPI_SLAVE_DMA_TX_UNIT, SPI_SLAVE_DMA_TX_CH, (uint32_t)&SpiDummyByte);
        //DMA_SetDesAddress(SPI_SLAVE_DMA_TX_UNIT, SPI_SLAVE_DMA_TX_CH, (uint32_t)&SPI_SLAVE_UNIT->DR);
        DMA_SetTransferCnt(SPI_SLAVE_DMA_TX_UNIT, SPI_SLAVE_DMA_TX_CH, len);
        DMA_SetTransferCnt(SPI_SLAVE_DMA_RX_UNIT, SPI_SLAVE_DMA_RX_CH, len);

