chengy2/goodix_hdsc_spi/hc32f46x_ddl_Rev1.1.1/example/spi/spi_fp_boot/source/misc.c
    DMA_Cmd(SPI_SLAVE_DMA_TX_UNIT, Enable);
    DMA_Cmd(SPI_SLAVE_DMA_RX_UNIT, Enable);
}
/**
 *******************************************************************************
 ** \brief  SPI slave init
 ** \param  None
 ** \retval None
 ******************************************************************************/
void SlaveSpiInit(void)
{
    stc_spi_init_t stcSpiInit;
    stc_port_init_t stcPortInit;

    /* configuration structure initialization */
    MEM_ZERO_STRUCT(stcSpiInit);
    MEM_ZERO_STRUCT(stcPortInit);

    /* Configuration peripheral clock */
    PWC_Fcg1PeriphClockCmd(SPI_SLAVE_UNIT_CLOCK, Enable);

    /* Configuration SPI pin */
    PORT_DebugPortSetting(TDO_SWO, Disable);
    PORT_DebugPortSetting(TRST, Disable);
    PORT_SetFunc(SPI_SLAVE_SCK_PORT, SPI_SLAVE_SCK_PIN, SPI_SLAVE_SCK_FUNC, Disable);
    PORT_SetFunc(SPI_SLAVE_MOSI_PORT, SPI_SLAVE_MOSI_PIN, SPI_SLAVE_MOSI_FUNC, Disable);
    PORT_SetFunc(SPI_SLAVE_MISO_PORT, SPI_SLAVE_MISO_PIN, SPI_SLAVE_MISO_FUNC, Disable);
    PORT_SetFunc(SPI_SLAVE_NSS_PORT, SPI_SLAVE_NSS_PIN, SPI_SLAVE_NSS_FUNC, Disable);

    SPI_DeInit(SPI_SLAVE_UNIT);
    /* Configuration SPI structure */
    stcSpiInit.enClkDiv = SpiClkDiv16;
    stcSpiInit.enFrameNumber = SpiFrameNumber1;
    stcSpiInit.enDataLength = SpiDataLengthBit8;
    stcSpiInit.enFirstBitPosition = SpiFirstBitPositionMSB;
    stcSpiInit.enSckPolarity = SpiSckIdleLevelLow;
    stcSpiInit.enSckPhase = SpiSckOddSampleEvenChange;
    stcSpiInit.enReadBufferObject = SpiReadReceiverBuffer;
    stcSpiInit.enWorkMode = SpiWorkMode4Line;
    stcSpiInit.enTransMode = SpiTransFullDuplex;
    stcSpiInit.enCommAutoSuspendEn = Disable;
    stcSpiInit.enModeFaultErrorDetectEn = Disable;
    stcSpiInit.enParitySelfDetectEn = Disable;
    stcSpiInit.enParityEn = Disable;
    stcSpiInit.enParity = SpiParityEven;
    stcSpiInit.enMasterSlaveMode = SpiModeSlave;
    stcSpiInit.stcDelayConfig.enSsSetupDelayOption = SpiSsSetupDelayCustomValue;
    stcSpiInit.stcDelayConfig.enSsSetupDelayTime = SpiSsSetupDelaySck1;
    stcSpiInit.stcDelayConfig.enSsHoldDelayOption = SpiSsHoldDelayCustomValue;
    stcSpiInit.stcDelayConfig.enSsHoldDelayTime = SpiSsHoldDelaySck1;
    stcSpiInit.stcDelayConfig.enSsIntervalTimeOption = SpiSsIntervalCustomValue;
    stcSpiInit.stcDelayConfig.enSsIntervalTime = SpiSsIntervalSck6PlusPck2;

    SPI_Init(SPI_SLAVE_UNIT, &stcSpiInit);
    SPI_Cmd(SPI_SLAVE_UNIT, Enable);

    SlaveSpiDmaInit();
}

/**
 *******************************************************************************
 ** \brief  SPI slave de-init
 ** \param  None
 ** \retval None
 ******************************************************************************/
void SlaveSpiDeInit(void)
{
    SPI_DeInit(SPI_SLAVE_UNIT);

    PORT_SetFunc(SPI_SLAVE_SCK_PORT, SPI_SLAVE_SCK_PIN, Func_Gpio, Disable);
    PORT_SetFunc(SPI_SLAVE_MOSI_PORT, SPI_SLAVE_MOSI_PIN, Func_Gpio, Disable);
    PORT_SetFunc(SPI_SLAVE_MISO_PORT, SPI_SLAVE_MISO_PIN, Func_Gpio, Disable);
    PORT_SetFunc(SPI_SLAVE_NSS_PORT, SPI_SLAVE_NSS_PIN, Func_Gpio, Disable);

    DMA_DeInit(SPI_SLAVE_DMA_TX_UNIT, SPI_SLAVE_DMA_TX_CH);
    DMA_DeInit(SPI_SLAVE_DMA_RX_UNIT, SPI_SLAVE_DMA_RX_CH);

    HAL_NVIC_DisableIRQ(SPI_SLAVE_DMA_TX_IRQn);
    HAL_NVIC_DisableIRQ(SPI_SLAVE_DMA_RX_IRQn);
}

/**
 *******************************************************************************
 ** \brief  MCU_CPU_IRQ pin init
 ** \param  None
 ** \retval None
 ******************************************************************************/
void MCU_CPU_IRQ_PinInit(void)
{
    stc_port_init_t stcPortInit;

    /* configuration structure initialization */
    MEM_ZERO_STRUCT(stcPortInit);

    stcPortInit.enPinMode = Pin_Mode_Out;
    PORT_Init(MCU_CPU_IRQ_PORT, MCU_CPU_IRQ_PIN, &stcPortInit);
}

/**
 *******************************************************************************
 ** \brief  Callback function for MOSI exint
 ** \param  None
 ** \retval None
 ******************************************************************************/
void MOSI_ExintCallback(void)
{
    /* add your code here */
    EXINT_IrqFlgClr(SPI_SLAVE_MOSI_EXINT_CH);
}

/**
 *******************************************************************************
 ** \brief  Exint configure for SPI slave MOSI pin
 ** \param  None
 ** \retval None
 ******************************************************************************/
void SpiMosiIntConfig(void)
{
    stc_exint_config_t stcExtiConfig;
    stc_irq_regi_conf_t stcIrqRegiConf;
    stc_port_init_t stcPortInit;

    /* GPIO input and exint enable */
    MEM_ZERO_STRUCT(stcPortInit);
    stcPortInit.enPinMode = Pin_Mode_In;
    stcPortInit.enExInt = Enable;
    PORT_Init(SPI_SLAVE_MOSI_PORT, SPI_SLAVE_MOSI_PIN, &stcPortInit);

    /* Exint config */
    stcExtiConfig.enExitCh = SPI_SLAVE_MOSI_EXINT_CH;
    stcExtiConfig.enFilterEn = Enable;
    stcExtiConfig.enFltClk = Pclk3Div8;
    stcExtiConfig.enExtiLvl = ExIntRisingEdge;  /* Rising edge */
    EXINT_Init(&stcExtiConfig);

    /* Select External Int Ch.11 */
    stcIrqRegiConf.enIntSrc = SPI_SLAVE_MOSI_INT_SRC;
    stcIrqRegiConf.enIRQn = SPI_SLAVE_MOSI_INT_IRQn;
    stcIrqRegiConf.pfnCallback = &MOSI_ExintCallback;
    enIrqRegistration(&stcIrqRegiConf);

    HAL_NVIC_ClearPendingIRQ(stcIrqRegiConf.enIRQn);
    HAL_NVIC_SetPriority(stcIrqRegiConf.enIRQn, 2, 0);
    HAL_NVIC_EnableIRQ(stcIrqRegiConf.enIRQn);

    /* Enable wakeup */
    enIntWakeupEnable(Extint0WU);
}

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
